; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 Star0)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 Star5)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 GroundStation6)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite2 Star0)
	(pointing satellite3 GroundStation6)
	(pointing satellite4 Planet8)
	(have_image Planet8 image1)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Star13 infrared0)
	(have_image Planet14 infrared0)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 11
2. (calibrate satellite4 instrument7 groundstation6)
   added: (calibrated instrument7)
   goals met: 0 of 11
3. (turn_to satellite4 planet11 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 planet11)
   goals met: 0 of 11
4. (take_image satellite4 planet11 instrument7 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 1 of 11
5. (turn_to satellite4 phenomenon9 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 11
6. (take_image satellite4 phenomenon9 instrument7 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 2 of 11
7. (turn_to satellite4 phenomenon10 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 11
8. (turn_to satellite3 groundstation6 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 groundstation6)
   goals met: 3 of 11
9. (turn_to satellite2 star0 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 star0)
   goals met: 4 of 11
10. (turn_to satellite0 star0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star0)
   goals met: 5 of 11
11. (take_image satellite4 phenomenon10 instrument7 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 11
12. (turn_to satellite4 planet12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet12)
   goals met: 6 of 11
13. (take_image satellite4 planet12 instrument7 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 7 of 11
14. (turn_to satellite4 planet14 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet14)
   goals met: 7 of 11
15. (take_image satellite4 planet14 instrument7 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 8 of 11
16. (turn_to satellite4 star13 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 star13)
   goals met: 8 of 11
17. (take_image satellite4 star13 instrument7 infrared0)
   added: (have_image star13 infrared0)
   goals met: 9 of 11
18. (turn_to satellite4 planet8 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 planet8)
   goals met: 10 of 11
19. (take_image satellite4 planet8 instrument7 image1)
   added: (have_image planet8 image1)
   goals met: 11 of 11
